class Circle:
    def __init__(self, center_coords, radius):
        ...

    def length(self):
        """
        :return: длину окружности
        """
        # TODO-1: реализуйте метод
        ...

    def area(self):
        """
        :return: площадь окружности
        """
        # TODO-2: реализуйте метод
        ...


# Окружности заданы координатами центров и радиусами
circle1 = Circle((6, -8), 5)
circle2 = Circle((2, 4), 4)

print(f"Длина окружности радиусом {...} = {...}")
print(f"Длина окружности радиусом {...} = {...}")

print(f"Площадь окружности радиусом {...} = {...}")
print(f"Площадь окружности радиусом {...} = {...}")