# Вам дан английский текст. Закодируйте его с помощью азбуки Морзе:
# https://en.wikipedia.org/wiki/Morse_code#/media/File:International_Morse_Code.svg
# Каждая буква заменяется на последовательность точек и тире.
# В качестве тире используйте обычный дефис: «-», а в качестве точки — точку «.». Например,
# буква «g» превратится в трёхсимвольную строку «—.». Между закодированными буквами нужно ставится ровно один пробел.
# Например, слово «Help» превратится в «…. . .-.. .—.».
# Обратите внимание, что строчные и заглавные буквы кодируются одинаково.

# TODO: your code here...
