# Выверите и скопируйте сюда наиболее подходяший алгоритм для работы с графом(bfs/dfs)

# Опишите список смежности по изображению лабиринта из файла task.md

graph = [
    # список смежности
    [1],  # 0
    [0, 2],  # 1
    [1, 3],  # 2
    [2, 7],  # 3
    [5],  # 4
    [4, 6],  # 5
    [5],  # 6
    [3, 11],  # 7
    [9, 12],  # 8
    [8, 10],  # 9
    [9, 11],  # 10
    [7, 10, 15],  # 11
    [8, 13],  # 12
    [12, 14],  # 13
    [13],  # 14
    [11],  # 15

]

dict1 = {1: 'S-1', 5: 'S-2', 15: 'S-3'}
print(dict1)
# visited = [False] * (len(graph))
start = [1, 5, 15]
final = 14


def dfs(v):
    visited[v] = True
    for w in graph[v]:
        if not visited[w]:  # посещён ли текущий сосед?
            dfs(w)


for i in start:
    visited = [False] * (len(graph))
    dfs(i)
    if visited[final]:
        print(f"Из точки {dict1[i]} можно дойти до финиша")
    else:
        print(f"Из точки {dict1[i]} нельзя дойти до финиша")

# Решите задачу и выведите ответ в нужном формате
