# Сумма с условием
# Дан массив(список) чисел.
# Найти: сумму элементов массива, больших данного числа А
num_a = 5
my_list = [5,6,7, 6,4,1]
for el in my_list:
    while num_a > el:
        new_list.sorted()
    else:
        append.other_list()
print(sum(new_list))

#!!!!!!!!!!!!!!!!!!!!!!!не рабочий код. Не знаю как елементы изолировать. !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 №Предыдущий игнорируйте пожалуйста
