import random
# Рекламная акция
# В сети магазинов "Н-Аудио" проводится рекламная акция. Каждый второй товар – бесплатно.
# Естественно, кассирам дано указание пробивать товары в таком порядке, чтобы магазин потерял как можно меньше денег.
# По списку товаров определите максимальную сумму в чеке.
#
# Вход: натуральное число товаров (N < 1000) и далее N натуральных чисел – цены товаров.
# Выход: одно число – максимальная сумма чека.

# Пример
# Вход:
# 5 2 1 10 50 10
# Выход:
# 70
# Пояснение:
# Возможен такой порядок: 10 2 50 1 10
cost = 1000
n = int(input("Число товаров: "))

items = []
for i in range(n):
    items.append(random.randint(0, cost))

items.sort()
check = 0
feefty = int(n/2) + 1
for cost_one in items[feefty:]:
    check += cost_one

print(check)
