# Выверите и скопируйте сюда наиболее подходяший алгоритм для работы с графом(bfs/dfs)

# Опишите список смежности по изображению лабиринта из файла task.md
graph = [
    [1],             # 0
    [0, 5],          # 1
    [6],             # 2
    [7],             # 3
    [5, 8],          # 4
    [4, 1],          # 5
    [2, 10],         # 6
    [3],             # 7
    [4, 9, 12],      # 8
    [8, 10],         # 9
    [9, 6, 11, 14],  # 10
    [10],            # 11
    [8],             # 12
    [],              # 13
    [10, 15],        # 14
    [14],            # 15
]
s1 = 0
s2 = 12
s3 = 3
F = 14
start = s1
new_graph = dfs(graph, start)
if new_graph[F] is False:
    print("No")
else:
    print("Yes")

# Решите задачу и выведите ответ в нужном формате
