# Выверите и скопируйте сюда наиболее подходяший алгоритм для работы с графом(bfs/dfs)

# Опишите список смежности по изображению лабиринта из файла task.md
graph = [
    [1],     #0
    [0,5],     #1
    [6],     #2
    [7],     #3
    [5,8],     #4
    [1,4],     #5
    [2,10],     #6
    [3],     #7
    [4,9,12],         #8
    [8,10],           #9
    [6,9,11,14],     #10
    [10],     #11
    [8],     #12
    [],     #13
    [10,15],     #14
    [14],     #15
]

starts = {'S-1': 0, 'S-2': 12, 'S-3': 3}
finish = 14



for point in starts.items():
    result = dfs(graph, point[1])
    if result[finish]:
        print(f'Из точки {point[0]} можно дойти до финиша')
    else:
        print(f'Из точки {point[0]} нельзя дойти до финиша')
