# DFS(Depth-First Search) - поиск в глубину
# Позволяет построить обход ориентированного или неориентированного графа,
# при котором посещаются все вершины, доступные из начальной вершины.

# Алгоритм обхода в глубину:
# 1. Пойти в какую-нибудь смежную вершину, не посещенную ранее.
# 2. Запустить из этой вершины алгоритм обхода в глубину
# 3. Вернуться в начальную вершину.
# 4. Повторить пункты 1-3 для всех не посещенных ранее смежных вершин.

#         3 --5--2   6--7
#        / \ /  /
#       0---1--4

def dfs(graph, start):
    visited = [False] * len(graph)

    def _dfs(v):
        visited[v] = True
        for w in graph[v]:
            if not visited[w]:  # посещён ли текущий сосед?
                _dfs(w)

    _dfs(start)
    return visited

def main():
    graph = [
        # список смежности
        [1],  # 0
        [0, 5],  # 1
        [6],  # 2
        [7],  # 3
        [5, 8],  # 4
        [1, 4],  # 5
        [2, 10],  # 6
        [3],  # 7
        [4, 12, 9],  # 8
        [8, 10],  # 9
        [9, 6, 11, 14],  # 10
        [10],  # 11
        [8],  # 12
        [],  # 13
        [10, 15],  # 14
        [14]  # 15
    ]

    start = {'s-1': 0, 's-2': 12, 's-3': 3}
    for i in start:
        visited = dfs(graph, start[i])
        if visited[14]:
            print(f'Из точки {i} можно дойти до финиша')
            continue
        print(f'Из точки {i} нельзя дойти до финиша')

main()
