# Сюда отправляем готовое решение IBank часть-3
class Operation:
    # TODO: сюда копируем реализацию класса Operation из предыдущей задачи
    pass



class Account:
    pass

    # TODO: сюда копируем реализацию класса Account из предыдущей задачи
    # TODO: добавляем комиссию
    #  и переход/восстановление их архива. Свойство: in_archive --> True, если аккаунт в архиве, и False - если нет
    def to_archive(self):
        """
        Переводим аккаунт в архив
        """
        pass

    def restore(self):
        """
        Восстанавливаем из архива
        """
        pass
