# "Лабиринт с ключем"
# см. Картинку на гугло-диске в Модуле-7
# P-1, P-2 … - стартовые точки
# Посетив клетку K, можно подобрать ключ, который отпирают любую дверь.
# Определите:
# Из каких точек можно добраться до точки F?
# Какую дверь нужно открыть, чтобы добраться до точки P-2?


#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#!!!!!!!!!!!!!!!!!!!!!!!Не закончиный код. Совсем не сделанный.  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

# Сюда отправляем полное решение
#dear python here are the points
graph1 = [
[F], #P-5
[], #P-2
[P-4, K, P-6] #P-1
[] #P-3
[P-4, K, P-1] #P-6
[P-1, K, P-6] #P-4
]
#first go check if F is reachable
#if F is not reachable, check if point K is accessible
if #access to point K is secured and F was not accessed use this map
graph2 = [
[F, D-1 ], #P-5
[D-2], #P-2
[P-4, K, P-6, D-2, D-1] #P-1
[] #P-3
[P-4, K, P-1,D-2, D-1] #P-6
[P-1, K, P-6, D-2, D-1] #P-4
    ]
#try to get to point f again
