def distance(p1, p2):
    """
    Расстояние между двумя точками
    """
    # TODO: напишите тело функции
    res = ((p2['x']-p1['x'])**2+(p2['y']-p1['y'])**2)**0.5
    return res


# Даны две точки на координатной плоскости
point1 = {"x": -8, "y": 5}
point2 = {"x": -2, "y": 4}

dist = distance(point1, point2)

print("Расстояние между точками = ", dist)
