class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y


# Ломаная линия задана последовательным списком точек
points = [Point(2, 4), Point(7, 5), Point(5, -2), Point(0, 6), Point(-12, 0)]

# Задание: Найдите длину ломаной линии
CODE CODE CODE
# TODO: your core here...
# my code

print("Длина ломаной линии = ", ...)
